general-config.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-04-20 Sat 14:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Spacemacs configuration - Sainath Adapa</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sainath Adapa">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Spacemacs configuration - Sainath Adapa</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org756279b">1. Appearance</a></li>
<li><a href="#org27ebe09">2. Backup and other file settings</a></li>
<li><a href="#org013338b">3. Miscellaneous</a></li>
<li><a href="#org1b1da5a">4. Org config</a></li>
<li><a href="#org72ffbb8">5. Disabled</a></li>
<li><a href="#orga53a4a6">6. Final</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org756279b" class="outline-2">
<h2 id="org756279b"><span class="section-number-2">1</span> Appearance</h2>
<div class="outline-text-2" id="text-1">
<p>
Disabling bent arrows (↩)<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> visual-line-fringe-indicators nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> fringe-indicator-alist '<span class="org-rainbow-delimiters-depth-2">(</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>truncation left-arrow right-arrow<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>continuation nil nil<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">left-curly-arrow</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>overlay-arrow . right-triangle<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>up . up-arrow<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>down . down-arrow<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>top top-left-angle top-right-angle<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>bottom bottom-left-angle bottom-right-angle top-right-angle top-left-angle<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>top-bottom left-bracket right-bracket top-right-angle top-left-angle<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>empty-line . empty-line<span class="org-rainbow-delimiters-depth-3">)</span>
                                       <span class="org-rainbow-delimiters-depth-3">(</span>unknown . question-mark<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org27ebe09" class="outline-2">
<h2 id="org27ebe09"><span class="section-number-2">2</span> Backup and other file settings</h2>
<div class="outline-text-2" id="text-2">
<p>
Store all backup and autosave files in the <code>/tmp</code> directory<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> backup-directory-alist
      `<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">".*"</span> . ,temporary-file-directory<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> auto-save-file-name-transforms
      `<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">".*"</span> ,temporary-file-directory t<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Backup by copying instead of renaming. See <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Backup-Copying.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Backup-Copying.html</a><br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> backup-by-copying t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Automatic deletion of backups. See <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Backup-Deletion.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Backup-Deletion.html</a><br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> delete-old-versions t
      kept-new-versions <span class="org-highlight-numbers-number">6</span>
      kept-old-versions <span class="org-highlight-numbers-number">2</span>
      version-control t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Do not create "lock" files.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> create-lockfiles nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Save files when emacs goes out of focus<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">save-all</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>save-some-buffers t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'focus-out-hook 'save-all<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Load any changes from disk automatically<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> global-auto-revert-mode t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org013338b" class="outline-2">
<h2 id="org013338b"><span class="section-number-2">3</span> Miscellaneous</h2>
<div class="outline-text-2" id="text-3">
<p>
Answer with y/n instead of having to write the full words<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>fset 'yes-or-no-p 'y-or-n-p<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Default browser to use<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> browse-url-browser-function 'browse-url-generic
      browse-url-generic-program <span class="org-string">"google-chrome-stable"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'helm
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> helm-display-function 'helm-default-display-buffer<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">temp work around</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b1da5a" class="outline-2">
<h2 id="org1b1da5a"><span class="section-number-2">4</span> Org config</h2>
<div class="outline-text-2" id="text-4">
<p>
Spacemacs requires the org-mode settings to be defined after the org-mode is activated.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'org
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">require</span> '<span class="org-constant">org-config</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Default file to open<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>find-file <span class="org-string">"~/Dropbox/org/main.org"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org72ffbb8" class="outline-2">
<h2 id="org72ffbb8"><span class="section-number-2">5</span> Disabled</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'epa-file)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(epa-file-enable)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq epa-file-cache-passphrase-for-symmetric-encryption t)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'python) ; if not done elsewhere</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'eval-in-repl-python)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'python-mode-hook</span>
<span class="org-comment-delimiter">;;           </span><span class="org-comment">'(lambda ()</span>
<span class="org-comment-delimiter">;;              </span><span class="org-comment">(local-set-key (kbd "&lt;C-return&gt;") 'eir-eval-in-python)))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">consider *.org.txt files as org files</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-to-list 'auto-mode-alist '("\\.org.txt\\'" . org-mode))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'helm-bookmark)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga53a4a6" class="outline-2">
<h2 id="orga53a4a6"><span class="section-number-2">6</span> Final</h2>
<div class="outline-text-2" id="text-6">
<p>
Let the Spacemacs use this configuration.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">provide</span> '<span class="org-constant">general-config</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sainath Adapa</p>
<p class="date">Created: 2019-04-20 Sat 14:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
